# โปรแกรมตรวจสอบข้อมูลสายรถเมล์ โดยที่
#       หากผู้ใช้ป้อนสายรถเมล์ 57 แสดงข้อความ สาย  57 ไปปิ่นเกล้า บางขุนนนท์
#       หากผู้ใช้ป้อนสายรถเมล์ 3 แสดงข้อความ สาย  3 ไปสนามหลวง ลาดพร้าว
#       หากผู้ใช้ป้อนสายรถเมล์ 71 แสดงข้อความ สาย  71ไปหัวลำโพง เยาวราช
#       หากผู้ใช้ป้อนสายรถเมล์ 56 แสดงข้อความ สาย 56 ไปบางลำพู สะพานกรุงธน
#       หากผูใช้ป้อนสายรถเมล์ 539 แสดงข้อความ สาย  539 ไปอนุสวรีย์ชัย สามเสน
#       หากผู้ใช้ป้อนสายรถเมล์สายอื่นนอกจากนี้ แสดงข้อความ ยังไม่มีข้อมูลสายรถเมล์ที่สอบถาม
 
print('+++++++++++++++++++++++++++++')
print('โปรแกรมตรวจสอบข้อมูลสายรถเมล์')
print('+++++++++++++++++++++++++++++')
car_no = input('ป้อนสายรถเมล์ : ')
print('+++++++++++++++++++++++++++++')
match car_no :
    case 57 :
        print('ไปปิ่นเกล้า บางขุนนนท์')
    case 3 :
        print('ไปสนามหลวง ลาดพร้าว')
    case 71 :
        print('ไปหัวลำโพง เยาวราช')
    case 56 :
        print('ไปบางลำพู สะพานกรุงธน')
    case 539 :
        print('ไปอนุสวรีย์ชัย สามเสน')
    case _ :
        print('ยังไม่มีข้อมูลสายรถเมล์ที่สอบถาม')
print('+++++++++++++++++++++++++++++')