# สร้างโปรแกรม Money Share V. 1.0 เพื่อคำนวณหาเงินที่ต้องหารกันว่าการกันคนละกี่บาท โดยป้อนจำนวนเงิน 
# และจำนวนคนทางแป้นพิมพ์แล้วแสดงผลเงินที่ต้องหารกันว่าต้องหารกันคนละกี่บาททางหน้าจอ
 
# ------------------------
#    โปรแกรม Money Share
# ------------------------
# ป้อนจำนวนเงิน: <input>
# ป้อนจำนวนคน: <input>
# ------------------------
# สรุปหารกันคนละ: <output> บาท
# ------------------------

print('=================================')
print(' Money Share')
print('=================================')
เงิน = int(input('ป้อนจ้ำนวนเงินIs : '))
คน = int(input('ป้อนจำนวนคนIs : '))
print('=================================')

sum = เงิน
avg = sum /คน

print(f'สรุปหารกันคนละIs: {avg}')
print('=================================')