# สร้างโปรแกรมคำนวณเงินเดือนสุทธิที่ต้องจ่ายหลังจากหักภาษีแล้ว 7% ของเงินเดือน  และหักค่าประกันสังคม 3% ของเงินเดือน
# โดยรับค่ารหัสพนักงาน ชื่อพนักงาน เงินเดือน ทางแป้นพิมพ์ และแสดงผลข้อมูลที่รับมา
# พร้อมกับรายละเอียดว่าต้องเสียภาษีกี่บาท หักค่าประกันสังคมกี่บาท และต้องจ่ายเงินเดือนสุทธิกี่บาท

print('=============')
print (' โปรแกรมคำนวดเงินเดือนสุทธิ ')
print('=============')
emp_id = input('รนัสพนักงาน :')
emp_name = input('ชื่อพนักงาน :')
emp_salary = float( input('เงินเดือน :') )
print('=============')
tax = emp_salary * 7 / 100        #คำนวณภาษี
insurance = emp_salary * 3 / 100  #คำนวณค่าประกันสังคม
emp_salary_net = emp_salary - tax - insurance
print('รหัสพนันงาน {} ชื่อ {}'.format(emp_id, emp_name))
print('เสียภาษี {} บาท ประกันสังคม {} บาท '.format(tax, insurance))
print(f'สรุปได้เงินเดือนสทธิ {emp_salary_net} บาท')
print('=============')