#โปรแกรมแสดงข้อความต้อนรับนักศึกษา โดยรับชื่อ และชั้นปีทางแป้นพิมพ์แล้วแสดงข้อความต้อนรับ ดังนี้
#กรณีป้อนชั้นปี 1 แสดงข้อความ "Welcome Freshman"
#กรณีป้อนชั้นปี 2 แสดงข้อความ "Welcome Sophomore" #กรณีป้อนชั้นปี 3 แสดงข้อความ "Welcome Junior"
#กรณีป้อนชั้นปี 4 แสดงข้อความ "Welcome Senior"
#กรณีป้อน ปีอื่นๆ  แสดงข้อความ "Oh, no ...."

print('=====================================')
print(' โปรแกรมแสดงข้อความต้อนรับนักศึกษา ')
print('=====================================')

ชื่อ = (input(' ชื่อนักศึกษา : '))
ชั้นปี = int(input(' ชั้นปีที่ศึกษา : '))

if ชั้นปี == 1 :
    print(' Welcome Freshman ')
elif ชั้นปี == 2 :
    print(' Welcome Sophomore ')
elif ชั้นปี == 3 : 
    print(' Welcome Junior ')
elif ชั้นปี == 4 :
    print(' Welcome Senior ')
else :
    print('Oh, no ....มึงไม่ใ้ช่เด็กในมอออออ')
print('=====================================')