# สร้างโปรแกรมคำนวณค่า BMI โดยรับ ชื่อ ค่าส่วนสูง(เซ็นติเมตร) และนำหนัก (กิโลกรัม) ทางแป้นพิมพ์ แล้วแสดงผลค่า BMI ที่คำนวณได้ทางหน้าจอ โดย
# BMI =  น้ำหนัก หารด้วย ส่วนสูงยกกำลัง2
 
# --------------------------------
#    โปรแกรม BMI CALCULATOR
# --------------------------------
# ป้อนชื่อ: <input>
# ป้อนน้ำหนัก: <input>
# ป้อนส่วนสูง: <input>
# --------------------------------
# คุณ <output> หนัก <output> kg. สูง <output> m.
# มีค่า BMI เป็น <output>
# --------------------------------

print("===========================")
print(" Program BMi CALCULATOR ")
print("===========================")

name = input("ป้อนชื่อ: ")
weight = float(input("ป้อนน้ำหนัก(กิโลกรัม): "))
height = float(input("ป้อนส่วนสูง(เซนติเมตร): ")) / 100

bmi = weight / (height ** 2)
print("===========================")
print("คุณ {} หนัก {:.2f} กิโลกรัม. สูง {:.2f} เซนติเมตร.".format(name, weight, height * 100))
print("มีค่า BMI เป็น {:.2f}".format(bmi))
print("===========================")
