#โปรแกรมตรวจสอบน้ำหนักรถบรรทุก ว่ารถบรรทุกนั้นมีน้ำหนักรถผ่านเกณฑ์หรือไม่ หากน้ำหนักเกิน 1000 ใ
# ห้แสดงข้อความว่า "รถทะเบียน ???? น้ำหนักรถไม่ผ่านเกณฑ์"  แต่หากน้ำหนักตั้งแต่ 1000 
# ลงมาให้แสดงข้อความว่า "รถทะเบียน ???? น้ำหนักรถผ่านเกณฑ์" โดยให้ป้อนทะเบียนรถบรรทุก และน้ำหนักรถบรรทุกทางแป้นพิมพ์

print('=====================================')
print(' Program ตรวจสอบน้ำหนักรถบรรทุก ')
print('=====================================')

ทะเบียนรถ = input('ทะเบียนรถ : ')
น้ำหนักรถ = float(input('น้ำหนักของรถ : '))

if น้ำหนักรถ >= 1000 :
    print(f'น้ำหนักรถบรรทุก {น้ำหนักรถ} ของทะเบียน {ทะเบียนรถ}')
    print(f'รถทะเบียน {ทะเบียนรถ} น้ำหนักรถไม่ผ่านเกณฑ์')
else :
    print(f'น้ำหนักรถบรรทุก {น้ำหนักรถ} ของทะเบียน {ทะเบียนรถ}')
    print(f'รถทะเบียน {ทะเบียนรถ} น้ำหนักผ่านเกณฑ์')